Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::ElementDefault::Modifier Class Reference
MEP Element Manager
Modifier of the ElementDefault. More...
#include <MEPElementDefault.hpp>
 Inheritance diagram for ACAPI::MEP::ElementDefault::Modifier:
 Public Member Functions
 void  | RemoveInsulation ()
Removes the insulation.
Result< void >  | SetInsulationThickness (double insulationThickness)
Sets the thickness of insulation on the ElementDefault.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ElementDefault.
 Protected Member Functions
Modifier (ElementDefault &parent)
Constructs a Modifier with the given parent ElementDefault.
Detailed Description
Modifier of the ElementDefault.
Constructor & Destructor Documentation
◆ Modifier()
 ACAPI::MEP::ElementDefault::Modifier::Modifier  |  ( |  ElementDefault & |  parent | )
protected
Constructs a Modifier with the given parent ElementDefault.
Parameters
parent | The parent ElementDefault.
Member Function Documentation
◆ SetInsulationThickness()
 Result< void > ACAPI::MEP::ElementDefault::Modifier::SetInsulationThickness  |  ( |  double |  insulationThickness | )
Sets the thickness of insulation on the ElementDefault.
Parameters
insulationThickness | The value to be set.
Returns
Returns an error if the Element is of cable carrier domain, otherwise nothing.
◆ SetObjectId()
 void ACAPI::MEP::ElementDefault::Modifier::SetObjectId  |  ( |  const API_Guid & |  libraryPartId | )
Sets the referenced library part of the ElementDefault.
Parameters
libraryPartId | The main GUID of the library part.